content/posts/fisica_per_applicazioni_di_realta_virtuale.md
+++
title = "Fisica per Applicazioni di Realtà Virtuale"
author = ["Daniel Biasiotto"]
date = 2023-12-05T05:51:00+01:00
tags = ["master", "university"]
draft = false
+++

-   Professore: Matteo Brogi


## Introduzione {#introduzione}

Fisica:

-   studio dei fenomeni naturali
-   attraverso la misura delle grandezze fisiche
    -   con evidenza sperimentale, determina se il _modello_ è inadeguato o meno

In antichità fisica e filosofia confluivano in un unica disciplina, con la prima rivoluzione scientifica del XVI-XVII secolo le due discipline vengono distinte.
Si definisce il metodo scientifico con la fisica classica.

-   descrive bene la realtà  alle scale abituali

La necessità di descrivere fenomeni macro e microscopici porta alla seconda rivoluzione scientifica del XIX-XX secolo.

-   contrasta con l'intuizione ma permette il progresso tecnologico
-   li metodo rimane lo stesso ma:
    -   la misura può essere distruttiva
    -   certi sistemi vanno descritti stocasticamente


### Cifre Significative e Decimali {#cifre-significative-e-decimali}

-   significative, numero di cifre che compongono il numero
    -   gli zeri all'inizio non si contano
-   decimali, numero di cifre dovo la virgola
-   le cifre tranne l'ultima sono _certe_, l'ultima è _incerta_

Da qua si fonda la **teoria degli errori**.


## Cinematica {#cinematica}

-   velocità media
-   velocità istantanea, derivata prima dello spostamento
-   accelerazione media
-   accelerazione istantanea, derivata prima della velocità, derivata seconda dello spostamento


### Moto Rettilineo Uniforme {#moto-rettilineo-uniforme}

-   velocità costante

\\[x = vt\\]


### Moto Rettilineo Uniformemente Accelerato {#moto-rettilineo-uniformemente-accelerato}

-   accelerazione costante


### Cinematica Bidimensionale {#cinematica-bidimensionale}

-   non basta la descrizione scalare
-   moto in \\[R^2\\]
-   spostamento come differenza vettoriale
-   versori cartesiani in ogni punto della traiettoria
    -   /hat{u}_T, tangente
    -   /[/hat{u}_N/], perpendicolare


## Dinamica {#dinamica}


## Lavoro e Energia {#lavoro-e-energia}


## Dinamica dei Sistemi {#dinamica-dei-sistemi}


## Onde Meccaniche {#onde-meccaniche}


## Acustica {#acustica}


## Ottica {#ottica}


## Meccanica dei Fluidi {#meccanica-dei-fluidi}
